/*Написать программу, которая из имеющегося массива целых чисел формирует массив из четных чисел.
Первоначальный массив можно ввести с клавиатуры, либо сгенерировать случайным образом. При решении не
рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами*/

Console.WriteLine("Введите пожалуйста своё имя");
string name = "unnamed";
Console.ReadLine(name);
Console.WriteLine($"Здравствуйте, {name}, вы запустили программу, которая из имеющегося массива чисел формирует массив из чётных чисел");
Console.WriteLine("Для того чтобы ввести массив самостоятельно, введите 1");
Console.WriteLine("Чтобы массив был сгенерирован из случайных чисел, введите 2");
int choise = 0;
Console.ReadLine(choise);
if (choise == 1)
{

}
if (choise == 2)
{

}